//KATEJOB1 JOB (INFO),'TEST for Highlighting',
//   NOTIFY=&SYSUID,
//   MSGCLASS=H,
//   MSGLEVEL=(1,1),
//   REGION=0M
//* Example JCL to be used to test kate syntax highlighting
//* License MIT
//GREP     EXEC PGM=ISRSUPC,
//         PARM=(SRCHCMP,ANYC,IDPFX,NOPRTCC)
//NEWDD    DD DSN=KATE.REXXLIB,DISP=OLD
//* OUTDD    DD SYSOUT=*
//OUTDD    DD PATHOPTS=(ORDWR,OTRUNC,OCREAT),
//             PATHMODE=(SIRWXU,SIRWXO),
//             PATHDISP=(KEEP,DELETE),
//             FILEDATA=TEXT,
//             PATH='/tmp/searched.3'
//SYSIN    DD *
 SRCHFOR  'STORAGE'
/*
//RACFSR   EXEC PGM=IKJEFT01
//SYSTSPRT DD DISP=SHR,DSN=&&KATE(SRCHABC)
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD *
 SEARCH CLASS(DATASET) FILTER(**) NOMASK
//LIST     EXEC PGM=IKJEFT01
//SYSTSPRT DD DISP=SHR,DSN=&&REPORT(LISTABC)
//SYSOUT   DD SYSOUT=*
//SYSTSIN  DD DISP=SHR,DSN=&&KATE(SRCHABC)   
// IF (RC GT 0) THEN
//CATFILE  EXEC PGM=IEBGENER
//SYSUT1   DD  DSN=&&REPORT(LISTABC)
//         DISP=SHR
//SYSUT2   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
// ELSE
//UNIXID   EXEC PGM=BPXBATCH,REGION=8M
//STDIN    DD SYSOUT=*
//STDOUT   DD SYSOUT=*
//STDPARM  DD   *
SH id
/*
// ENDIF
